<?php
require("../../inc/header.php");

/*
		SoftName : EmpireBak Version 2010
		Author   : wm_chief
		Copyright: Powered by www.phome.net
*/

E_D("DROP TABLE IF EXISTS `ty_transport_extend`;");
E_C("CREATE TABLE `ty_transport_extend` (
  `id` mediumint(8) unsigned NOT NULL AUTO_INCREMENT COMMENT '运费模板扩展ID',
  `area_id` text COMMENT '市级地区ID组成的串，以，隔开，两端也有，',
  `top_area_id` text COMMENT '省级地区ID组成的串，以，隔开，两端也有，',
  `area_name` text COMMENT '地区name组成的串，以，隔开',
  `sprice` decimal(10,2) DEFAULT '0.00' COMMENT '首件运费',
  `transport_id` mediumint(8) unsigned NOT NULL COMMENT '运费模板ID',
  `transport_title` varchar(60) DEFAULT NULL COMMENT '运费模板',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=4 DEFAULT CHARSET=utf8 COMMENT='运费模板扩展表'");
E_D("replace into `ty_transport_extend` values('1',',1,36,2,40,3,73,74,75,76,77,78,79,80,81,82,83,4,84,85,86,87,88,89,90,91,92,93,94,5,95,96,97,98,99,100,101,102,103,104,105,106,13,203,204,205,206,207,208,209,210,211,19,289,290,291,292,293,294,295,296,297,298,299,300,301,302,303,304,305,306,307,308,309,20,310,311,312,313,314,315,316,317,318,319,320,321,322,323,21,324,325,326,327,328,329,330,331,332,333,334,335,336,337,338,339,340,341,342,343,344,',',1,2,3,4,5,13,19,20,21,','北京,天津,河北,山西,内蒙古,福建,广东,广西,海南','10.00','1','夹着胡');");
E_D("replace into `ty_transport_extend` values('2',',9,39,10,162,163,164,165,166,167,168,169,170,171,172,173,174,11,175,176,177,178,179,180,181,182,183,184,185,12,186,187,188,189,190,191,192,193,194,195,196,197,198,199,200,201,202,14,212,213,214,215,216,217,218,219,220,221,222,15,223,224,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,',',9,10,11,12,14,15,','上海,江苏,浙江,安徽,江西,山东','12.00','1','夹着胡');");
E_D("replace into `ty_transport_extend` values('3',',27,438,439,440,441,442,443,444,445,446,447,28,448,449,450,451,452,453,454,455,456,457,458,459,460,461,29,462,463,464,465,466,467,468,469,30,470,471,472,473,474,31,475,476,477,478,479,480,481,482,483,484,485,486,487,488,489,490,491,492,',',27,28,29,30,31,','陕西,甘肃,青海,宁夏,新疆','15.00','1','夹着胡');");

require("../../inc/footer.php");
?>